MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx575f256h.h
extern volatile __C1RXOVFbits_t C1RXOVFbits __asm__ ("C1RXOVF") __attribute__((section("sfrs"), address(0xBF88B060)));
extern volatile uint32_t        C1RXOVFCLR __attribute__((section("sfrs"),address(0xBF88B064)));
extern volatile uint32_t        C1RXOVFSET __attribute__((section("sfrs"),address(0xBF88B068)));
extern volatile uint32_t        C1RXOVFINV __attribute__((section("sfrs"),address(0xBF88B06C)));
#define C1TMR C1TMR
extern volatile uint32_t   C1TMR __attribute__((section("sfrs"), address(0xBF88B070)));
typedef union {
  struct {
    uint32_t CANTSPRE:16;
    uint32_t CANTS:16;
  };
  struct {
    uint32_t w:32;
  };
} __C1TMRbits_t;
extern volatile __C1TMRbits_t C1TMRbits __asm__ ("C1TMR") __attribute__((section("sfrs"), address(0xBF88B070)));
extern volatile uint32_t        C1TMRCLR __attribute__((section("sfrs"),address(0xBF88B074)));
extern volatile uint32_t        C1TMRSET __attribute__((section("sfrs"),address(0xBF88B078)));
extern volatile uint32_t        C1TMRINV __attribute__((section("sfrs"),address(0xBF88B07C)));
#define C1RXM0 C1RXM0
extern volatile uint32_t   C1RXM0 __attribute__((section("sfrs"), address(0xBF88B080)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t MIDE:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXM0bits_t;
extern volatile __C1RXM0bits_t C1RXM0bits __asm__ ("C1RXM0") __attribute__((section("sfrs"), address(0xBF88B080)));
extern volatile uint32_t        C1RXM0CLR __attribute__((section("sfrs"),address(0xBF88B084)));
extern volatile uint32_t        C1RXM0SET __attribute__((section("sfrs"),address(0xBF88B088)));
extern volatile uint32_t        C1RXM0INV __attribute__((section("sfrs"),address(0xBF88B08C)));
#define C1RXM1 C1RXM1
extern volatile uint32_t   C1RXM1 __attribute__((section("sfrs"), address(0xBF88B090)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t MIDE:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXM1bits_t;
extern volatile __C1RXM1bits_t C1RXM1bits __asm__ ("C1RXM1") __attribute__((section("sfrs"), address(0xBF88B090)));
extern volatile uint32_t        C1RXM1CLR __attribute__((section("sfrs"),address(0xBF88B094)));
extern volatile uint32_t        C1RXM1SET __attribute__((section("sfrs"),address(0xBF88B098)));
extern volatile uint32_t        C1RXM1INV __attribute__((section("sfrs"),address(0xBF88B09C)));
#define C1RXM2 C1RXM2
extern volatile uint32_t   C1RXM2 __attribute__((section("sfrs"), address(0xBF88B0A0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t MIDE:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXM2bits_t;
extern volatile __C1RXM2bits_t C1RXM2bits __asm__ ("C1RXM2") __attribute__((section("sfrs"), address(0xBF88B0A0)));
extern volatile uint32_t        C1RXM2CLR __attribute__((section("sfrs"),address(0xBF88B0A4)));
extern volatile uint32_t        C1RXM2SET __attribute__((section("sfrs"),address(0xBF88B0A8)));
extern volatile uint32_t        C1RXM2INV __attribute__((section("sfrs"),address(0xBF88B0AC)));
#define C1RXM3 C1RXM3
extern volatile uint32_t   C1RXM3 __attribute__((section("sfrs"), address(0xBF88B0B0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t MIDE:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXM3bits_t;
extern volatile __C1RXM3bits_t C1RXM3bits __asm__ ("C1RXM3") __attribute__((section("sfrs"), address(0xBF88B0B0)));
extern volatile uint32_t        C1RXM3CLR __attribute__((section("sfrs"),address(0xBF88B0B4)));
extern volatile uint32_t        C1RXM3SET __attribute__((section("sfrs"),address(0xBF88B0B8)));
extern volatile uint32_t        C1RXM3INV __attribute__((section("sfrs"),address(0xBF88B0BC)));
#define C1FLTCON0 C1FLTCON0
extern volatile uint32_t   C1FLTCON0 __attribute__((section("sfrs"), address(0xBF88B0C0)));
typedef union {
  struct {
    uint32_t FSEL0:5;
    uint32_t MSEL0:2;
    uint32_t FLTEN0:1;
    uint32_t FSEL1:5;
    uint32_t MSEL1:2;
    uint32_t FLTEN1:1;
    uint32_t FSEL2:5;
    uint32_t MSEL2:2;
    uint32_t FLTEN2:1;
    uint32_t FSEL3:5;
    uint32_t MSEL3:2;
    uint32_t FLTEN3:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FLTCON0bits_t;
extern volatile __C1FLTCON0bits_t C1FLTCON0bits __asm__ ("C1FLTCON0") __attribute__((section("sfrs"), address(0xBF88B0C0)));
extern volatile uint32_t        C1FLTCON0CLR __attribute__((section("sfrs"),address(0xBF88B0C4)));
extern volatile uint32_t        C1FLTCON0SET __attribute__((section("sfrs"),address(0xBF88B0C8)));
extern volatile uint32_t        C1FLTCON0INV __attribute__((section("sfrs"),address(0xBF88B0CC)));
#define C1FLTCON1 C1FLTCON1
extern volatile uint32_t   C1FLTCON1 __attribute__((section("sfrs"), address(0xBF88B0D0)));
typedef union {
  struct {
    uint32_t FSEL4:5;
    uint32_t MSEL4:2;
    uint32_t FLTEN4:1;
    uint32_t FSEL5:5;
    uint32_t MSEL5:2;
    uint32_t FLTEN5:1;
    uint32_t FSEL6:5;
    uint32_t MSEL6:2;
    uint32_t FLTEN6:1;
    uint32_t FSEL7:5;
    uint32_t MSEL7:2;
    uint32_t FLTEN7:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FLTCON1bits_t;
extern volatile __C1FLTCON1bits_t C1FLTCON1bits __asm__ ("C1FLTCON1") __attribute__((section("sfrs"), address(0xBF88B0D0)));
extern volatile uint32_t        C1FLTCON1CLR __attribute__((section("sfrs"),address(0xBF88B0D4)));
extern volatile uint32_t        C1FLTCON1SET __attribute__((section("sfrs"),address(0xBF88B0D8)));
extern volatile uint32_t        C1FLTCON1INV __attribute__((section("sfrs"),address(0xBF88B0DC)));
#define C1FLTCON2 C1FLTCON2
extern volatile uint32_t   C1FLTCON2 __attribute__((section("sfrs"), address(0xBF88B0E0)));
typedef union {
  struct {
    uint32_t FSEL8:5;
    uint32_t MSEL8:2;
    uint32_t FLTEN8:1;
    uint32_t FSEL9:5;
    uint32_t MSEL9:2;
    uint32_t FLTEN9:1;
    uint32_t FSEL10:5;
    uint32_t MSEL10:2;
    uint32_t FLTEN10:1;
    uint32_t FSEL11:5;
    uint32_t MSEL11:2;
    uint32_t FLTEN11:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FLTCON2bits_t;
extern volatile __C1FLTCON2bits_t C1FLTCON2bits __asm__ ("C1FLTCON2") __attribute__((section("sfrs"), address(0xBF88B0E0)));
extern volatile uint32_t        C1FLTCON2CLR __attribute__((section("sfrs"),address(0xBF88B0E4)));
extern volatile uint32_t        C1FLTCON2SET __attribute__((section("sfrs"),address(0xBF88B0E8)));
extern volatile uint32_t        C1FLTCON2INV __attribute__((section("sfrs"),address(0xBF88B0EC)));
#define C1FLTCON3 C1FLTCON3
extern volatile uint32_t   C1FLTCON3 __attribute__((section("sfrs"), address(0xBF88B0F0)));
typedef union {
  struct {
    uint32_t FSEL12:5;
    uint32_t MSEL12:2;
    uint32_t FLTEN12:1;
    uint32_t FSEL13:5;
    uint32_t MSEL13:2;
    uint32_t FLTEN13:1;
    uint32_t FSEL14:5;
    uint32_t MSEL14:2;
    uint32_t FLTEN14:1;
    uint32_t FSEL15:5;
    uint32_t MSEL15:2;
    uint32_t FLTEN15:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FLTCON3bits_t;
