MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx575f256h.h
#define _CNPUE_CNPUE12_POSITION                  0x0000000C
#define _CNPUE_CNPUE12_MASK                      0x00001000
#define _CNPUE_CNPUE12_LENGTH                    0x00000001

#define _CNPUE_CNPUE13_POSITION                  0x0000000D
#define _CNPUE_CNPUE13_MASK                      0x00002000
#define _CNPUE_CNPUE13_LENGTH                    0x00000001

#define _CNPUE_CNPUE14_POSITION                  0x0000000E
#define _CNPUE_CNPUE14_MASK                      0x00004000
#define _CNPUE_CNPUE14_LENGTH                    0x00000001

#define _CNPUE_CNPUE15_POSITION                  0x0000000F
#define _CNPUE_CNPUE15_MASK                      0x00008000
#define _CNPUE_CNPUE15_LENGTH                    0x00000001

#define _CNPUE_CNPUE16_POSITION                  0x00000010
#define _CNPUE_CNPUE16_MASK                      0x00010000
#define _CNPUE_CNPUE16_LENGTH                    0x00000001

#define _CNPUE_CNPUE17_POSITION                  0x00000011
#define _CNPUE_CNPUE17_MASK                      0x00020000
#define _CNPUE_CNPUE17_LENGTH                    0x00000001

#define _CNPUE_CNPUE18_POSITION                  0x00000012
#define _CNPUE_CNPUE18_MASK                      0x00040000
#define _CNPUE_CNPUE18_LENGTH                    0x00000001

#define _CNPUE_w_POSITION                        0x00000000
#define _CNPUE_w_MASK                            0xFFFFFFFF
#define _CNPUE_w_LENGTH                          0x00000020

#define _C1CON_DNCNT_POSITION                    0x00000000
#define _C1CON_DNCNT_MASK                        0x0000001F
#define _C1CON_DNCNT_LENGTH                      0x00000005

#define _C1CON_CANBUSY_POSITION                  0x0000000B
#define _C1CON_CANBUSY_MASK                      0x00000800
#define _C1CON_CANBUSY_LENGTH                    0x00000001

#define _C1CON_SIDL_POSITION                     0x0000000D
#define _C1CON_SIDL_MASK                         0x00002000
#define _C1CON_SIDL_LENGTH                       0x00000001

#define _C1CON_ON_POSITION                       0x0000000F
#define _C1CON_ON_MASK                           0x00008000
#define _C1CON_ON_LENGTH                         0x00000001

#define _C1CON_CANCAP_POSITION                   0x00000014
#define _C1CON_CANCAP_MASK                       0x00100000
#define _C1CON_CANCAP_LENGTH                     0x00000001

#define _C1CON_OPMOD_POSITION                    0x00000015
#define _C1CON_OPMOD_MASK                        0x00E00000
#define _C1CON_OPMOD_LENGTH                      0x00000003

#define _C1CON_REQOP_POSITION                    0x00000018
#define _C1CON_REQOP_MASK                        0x07000000
#define _C1CON_REQOP_LENGTH                      0x00000003

#define _C1CON_ABAT_POSITION                     0x0000001B
#define _C1CON_ABAT_MASK                         0x08000000
#define _C1CON_ABAT_LENGTH                       0x00000001

#define _C1CON_w_POSITION                        0x00000000
#define _C1CON_w_MASK                            0xFFFFFFFF
#define _C1CON_w_LENGTH                          0x00000020

#define _C1CFG_BRP_POSITION                      0x00000000
#define _C1CFG_BRP_MASK                          0x0000003F
#define _C1CFG_BRP_LENGTH                        0x00000006

#define _C1CFG_SJW_POSITION                      0x00000006
#define _C1CFG_SJW_MASK                          0x000000C0
#define _C1CFG_SJW_LENGTH                        0x00000002

#define _C1CFG_PRSEG_POSITION                    0x00000008
#define _C1CFG_PRSEG_MASK                        0x00000700
#define _C1CFG_PRSEG_LENGTH                      0x00000003

#define _C1CFG_SEG1PH_POSITION                   0x0000000B
#define _C1CFG_SEG1PH_MASK                       0x00003800
#define _C1CFG_SEG1PH_LENGTH                     0x00000003

#define _C1CFG_SAM_POSITION                      0x0000000E
#define _C1CFG_SAM_MASK                          0x00004000
#define _C1CFG_SAM_LENGTH                        0x00000001

#define _C1CFG_SEG2PHTS_POSITION                 0x0000000F
#define _C1CFG_SEG2PHTS_MASK                     0x00008000
#define _C1CFG_SEG2PHTS_LENGTH                   0x00000001

#define _C1CFG_SEG2PH_POSITION                   0x00000010
#define _C1CFG_SEG2PH_MASK                       0x00070000
#define _C1CFG_SEG2PH_LENGTH                     0x00000003

#define _C1CFG_WAKFIL_POSITION                   0x00000016
#define _C1CFG_WAKFIL_MASK                       0x00400000
#define _C1CFG_WAKFIL_LENGTH                     0x00000001

#define _C1CFG_w_POSITION                        0x00000000
#define _C1CFG_w_MASK                            0xFFFFFFFF
#define _C1CFG_w_LENGTH                          0x00000020

#define _C1INT_TBIF_POSITION                     0x00000000
#define _C1INT_TBIF_MASK                         0x00000001
#define _C1INT_TBIF_LENGTH                       0x00000001

#define _C1INT_RBIF_POSITION                     0x00000001
#define _C1INT_RBIF_MASK                         0x00000002
#define _C1INT_RBIF_LENGTH                       0x00000001

#define _C1INT_CTMRIF_POSITION                   0x00000002
#define _C1INT_CTMRIF_MASK                       0x00000004
#define _C1INT_CTMRIF_LENGTH                     0x00000001

#define _C1INT_MODIF_POSITION                    0x00000003
#define _C1INT_MODIF_MASK                        0x00000008
#define _C1INT_MODIF_LENGTH                      0x00000001

#define _C1INT_RBOVIF_POSITION                   0x0000000B
#define _C1INT_RBOVIF_MASK                       0x00000800
#define _C1INT_RBOVIF_LENGTH                     0x00000001

#define _C1INT_SERRIF_POSITION                   0x0000000C
#define _C1INT_SERRIF_MASK                       0x00001000
#define _C1INT_SERRIF_LENGTH                     0x00000001

#define _C1INT_CERRIF_POSITION                   0x0000000D
#define _C1INT_CERRIF_MASK                       0x00002000
#define _C1INT_CERRIF_LENGTH                     0x00000001

#define _C1INT_WAKIF_POSITION                    0x0000000E
#define _C1INT_WAKIF_MASK                        0x00004000
#define _C1INT_WAKIF_LENGTH                      0x00000001

#define _C1INT_IVRIF_POSITION                    0x0000000F
#define _C1INT_IVRIF_MASK                        0x00008000
#define _C1INT_IVRIF_LENGTH                      0x00000001

#define _C1INT_TBIE_POSITION                     0x00000010
#define _C1INT_TBIE_MASK                         0x00010000
#define _C1INT_TBIE_LENGTH                       0x00000001

